[
  {
    "symbol": "AAPL",
    "name": "Apple Inc",
    "assetType": "Common Stock",
    "description": "Apple Inc. is a preeminent American multinational technology company renowned for its innovative consumer electronics, software, and online services. With a staggering revenue of $274.5 billion in 2020, it stands as the world's most valuable publicly traded company, significantly influencing the global technology sector. Its flagship products—iPhone, iPad, and Mac—continue to define consumer expectations and set industry benchmarks, securing its position as a leader in both the smartphone and personal computer markets. As a key player among the \"Big Five\" technology firms, Apple remains at the forefront of technological advancements and consumer engagement strategies.",
    "exchange": "NASDAQ",
    "sector": "TECHNOLOGY",
    "industry": "CONSUMER ELECTRONICS",
    "marketCap": "4061369729000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:18:26.541Z"
  },
  {
    "symbol": "AMZN",
    "name": "Amazon.com Inc",
    "assetType": "Common Stock",
    "description": "Amazon.com, Inc. is a premier American multinational technology company that excels in e-commerce, cloud computing through Amazon Web Services (AWS), and digital streaming services. Recognized as one of the \"Big Five\" technology giants, Amazon's relentless focus on customer experience and innovative solutions has solidified its status as one of the world's most valuable brands. With significant investments in artificial intelligence, logistics, and various emerging technologies, Amazon is strategically positioned to capitalize on evolving market trends and strengthen its competitive advantage in the fast-paced digital economy.",
    "exchange": "NASDAQ",
    "sector": "CONSUMER CYCLICAL",
    "industry": "INTERNET RETAIL",
    "marketCap": "2430420648000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:19:03.025Z"
  },
  {
    "symbol": "GOOGL",
    "name": "Alphabet Inc Class A",
    "assetType": "Common Stock",
    "description": "Alphabet Inc. (GOOGL) is a premier American multinational conglomerate headquartered in Mountain View, California. Established as the parent company of Google and its subsidiaries in October 2015, Alphabet is a major player in various sectors, including online advertising, cloud computing, consumer electronics, and artificial intelligence. The company, led by co-founders Larry Page and Sergey Brin, showcases a solid commitment to innovation and technological advancement. With its diverse operational portfolio and strong market presence, Alphabet continues to present lucrative growth opportunities and value creation for institutional investors.",
    "exchange": "NASDAQ",
    "sector": "COMMUNICATION SERVICES",
    "industry": "INTERNET CONTENT & INFORMATION",
    "marketCap": "3720359444000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:18:50.870Z"
  },
  {
    "symbol": "JNJ",
    "name": null,
    "assetType": null,
    "description": null,
    "exchange": null,
    "sector": null,
    "industry": null,
    "marketCap": null,
    "logoUrl": null,
    "overviewFetchedAt": null
  },
  {
    "symbol": "JPM",
    "name": "JPMorgan Chase & Co",
    "assetType": "Common Stock",
    "description": "JPMorgan Chase & Co. is a leading American multinational investment bank and financial services holding company, renowned as one of the Big Four banks in the U.S. Headquartered in New York City, the firm offers a robust portfolio of services, including investment banking, asset management, private banking, and treasury services, under the prestigious J.P. Morgan brand. With a significant global presence and a commitment to innovation in financial solutions, JPMorgan Chase is well-equipped to meet the intricate demands of institutional investors, while maintaining a strong focus on regulatory compliance and risk management best practices.",
    "exchange": "NYSE",
    "sector": "FINANCIAL SERVICES",
    "industry": "BANKS - DIVERSIFIED",
    "marketCap": "872249426000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:19:51.779Z"
  },
  {
    "symbol": "KO",
    "name": null,
    "assetType": null,
    "description": null,
    "exchange": null,
    "sector": null,
    "industry": null,
    "marketCap": null,
    "logoUrl": null,
    "overviewFetchedAt": null
  },
  {
    "symbol": "MA",
    "name": "Mastercard Inc",
    "assetType": "Common Stock",
    "description": "Mastercard Incorporated is a global leader in financial services, headquartered in Purchase, New York, with significant operational presence in O'Fallon, Missouri. The company excels in facilitating electronic payments, connecting merchants with card-issuing banks through a comprehensive suite of debit, credit, and prepaid card services. With a strong focus on innovation and digital transformation, Mastercard has achieved substantial growth since its IPO in 2006, adeptly adapting to shifting consumer behaviors and technological advancements. As a pivotal player in the global payment systems landscape, Mastercard continues to solidify its market leadership by expanding its service offerings and international footprint.",
    "exchange": "NYSE",
    "sector": "FINANCIAL SERVICES",
    "industry": "CREDIT SERVICES",
    "marketCap": "517302682000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:20:16.114Z"
  },
  {
    "symbol": "META",
    "name": "Meta Platforms Inc.",
    "assetType": "Common Stock",
    "description": "Meta Platforms, Inc. is a preeminent technology company headquartered in Menlo Park, California, known for revolutionizing social interactions through its major platforms such as Facebook, Instagram, and WhatsApp. As a leader in the advancement of virtual and augmented reality through its Reality Labs division, Meta is strategically positioned at the forefront of the emerging metaverse, driving innovations in consumer engagement. The company's substantial investments in immersive technologies not only expand its vast and varied user base but also bolster its advertising revenue, solidifying Meta's role as a key player in the dynamic digital economy.",
    "exchange": "NASDAQ",
    "sector": "COMMUNICATION SERVICES",
    "industry": "INTERNET CONTENT & INFORMATION",
    "marketCap": "1660448014000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:19:27.450Z"
  },
  {
    "symbol": "MSFT",
    "name": "Microsoft Corporation",
    "assetType": "Common Stock",
    "description": "Microsoft Corporation is a premier American multinational technology company, recognized for its extensive portfolio that includes operating systems, productivity software, and innovative hardware solutions. Best known for its Windows operating system and Office productivity suite, Microsoft also holds a significant presence in the gaming industry through its Xbox platform and offers a range of Surface devices. As a leader in digital transformation, the company leverages its Azure cloud computing services to enhance productivity and drive innovation across multiple sectors. With a robust market position and a strong commitment to research and development, Microsoft is integral to shaping the future of technology on a global scale.",
    "exchange": "NASDAQ",
    "sector": "TECHNOLOGY",
    "industry": "SOFTWARE - INFRASTRUCTURE",
    "marketCap": "3611924365000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:18:38.709Z"
  },
  {
    "symbol": "NVDA",
    "name": "NVIDIA Corporation",
    "assetType": "Common Stock",
    "description": "NVIDIA Corporation is a leading American multinational technology company headquartered in Santa Clara, California, renowned for its pioneering advancements in graphics processing units (GPUs) tailored for both gaming and professional sectors. As a key player in artificial intelligence and visual computing, NVIDIA develops critical technologies, including System on a Chip (SoC) products that significantly bolster mobile computing and automotive applications, particularly in the burgeoning autonomous driving sector. With a diversified portfolio spanning gaming, data centers, and AI infrastructure, NVIDIA is well-positioned to address the dynamic demands of the technology landscape, continually pushing the boundaries of innovation and performance.",
    "exchange": "NASDAQ",
    "sector": "TECHNOLOGY",
    "industry": "SEMICONDUCTORS",
    "marketCap": "4406563570000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:19:15.244Z"
  },
  {
    "symbol": "PEP",
    "name": null,
    "assetType": null,
    "description": null,
    "exchange": null,
    "sector": null,
    "industry": null,
    "marketCap": null,
    "logoUrl": null,
    "overviewFetchedAt": null
  },
  {
    "symbol": "PG",
    "name": null,
    "assetType": null,
    "description": null,
    "exchange": null,
    "sector": null,
    "industry": null,
    "marketCap": null,
    "logoUrl": null,
    "overviewFetchedAt": null
  },
  {
    "symbol": "TSLA",
    "name": "Tesla Inc",
    "assetType": "Common Stock",
    "description": "Tesla, Inc. is a pioneering American electric vehicle and clean energy company headquartered in Palo Alto, California, recognized for its transformative innovations in sustainable mobility and energy solutions. As a dominant player in the industry, Tesla held a 16% market share in the global plug-in vehicle market and 23% in the battery-electric vehicle segment in 2020, underscoring its leadership and commitment to electric mobility. The company’s comprehensive product lineup includes not only electric vehicles but also cutting-edge battery technology and solar energy solutions, with Tesla Energy focused on storage and solar products that promote renewable energy use. With robust investments in scaling production and a strong emphasis on technological development, Tesla is strategically positioned to benefit from the rapid global shift towards sustainable energy paradigms.",
    "exchange": "NASDAQ",
    "sector": "CONSUMER CYCLICAL",
    "industry": "AUTO MANUFACTURERS",
    "marketCap": "1600384270000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:19:39.611Z"
  },
  {
    "symbol": "V",
    "name": "Visa Inc. Class A",
    "assetType": "Common Stock",
    "description": "Visa Inc. (NYSE: V), based in Foster City, California, stands at the forefront of the global financial services industry, recognized for its integral role in electronic funds transfers. Operating the largest retail electronic payments network worldwide, Visa provides a wide range of payment solutions through its extensive portfolio of branded credit, debit, and prepaid cards for consumers and businesses. With a strong emphasis on innovation in payment technology, the company is poised to take advantage of the ongoing shift toward digital transactions and e-commerce, reinforcing its leadership position and substantial market valuation in an increasingly cashless economy.",
    "exchange": "NYSE",
    "sector": "FINANCIAL SERVICES",
    "industry": "CREDIT SERVICES",
    "marketCap": "674016592000",
    "logoUrl": null,
    "overviewFetchedAt": "2025-12-22T07:20:03.948Z"
  },
  {
    "symbol": "XOM",
    "name": null,
    "assetType": null,
    "description": null,
    "exchange": null,
    "sector": null,
    "industry": null,
    "marketCap": null,
    "logoUrl": null,
    "overviewFetchedAt": null
  }
]